nithishkumarp2122/PIC16F877A-GPIO-Peripheral-Programming/08_Communication Protocols/31.SPI STRING TX/SPI_STRING_TX.X/SPI_STRING_TX.c
// PIC16F877A Configuration Bit Settings

// 'C' source line config statements

// CONFIG
#pragma config FOSC = HS        // Oscillator Selection bits (HS oscillator)
#pragma config WDTE = OFF       // Watchdog Timer Enable bit (WDT disabled)
#pragma config PWRTE = OFF      // Power-up Timer Enable bit (PWRT disabled)
#pragma config BOREN = OFF      // Brown-out Reset Enable bit (BOR disabled)
#pragma config LVP = OFF        // Low-Voltage (Single-Supply) In-Circuit Serial Programming Enable bit (RB3 is digital I/O, HV on MCLR must be used for programming)
#pragma config CPD = OFF        // Data EEPROM Memory Code Protection bit (Data EEPROM code protection off)
#pragma config WRT = OFF        // Flash Program Memory Write Enable bits (Write protection off; all program memory may be written to by EECON control)
#pragma config CP = OFF         // Flash Program Memory Code Protection bit (Code protection off)

// #pragma config statements should precede project file includes.
// Use project enums instead of #define for ON and OFF.

#include <xc.h>

#define _XTAL_FREQ 20000000
#define SS1 RC0
void string_data(char *s);
void data_tx(char a);
void master_init()
slave_init();
slave_init();
{
    TRISC = 0x10;
    SSPCON = 0x20;
    SSPSTAT = 0x00;
}

int main()
{
    master_init();
    
     SS1 = 1; //high to low for starting chip select
    __delay_ms(10);
    SS1 =  0;
    string_data("HELLO");
    SS1 = 1;
    while(1);
    
}

{
    slave2_init();
    
     SS2 = 1; //high to low for starting chip select
    __delay_ms(10);
    SS2 =  0;
    string_data("NITHISH");
    SS2 = 1;
    while(1);
    
}

{
    slave3_init();
    SS3 = 1; //high to low for starting chip select
    __delay_ms(10);
    SS3 =  0;
    string_data("NITHISH");
    SS3 = 1;
    while(1);
    
}


void data_tx(char a)
{
    SSPBUF = a ;
     while(SSPIF ==0);
    SSPIF = 0;
    __delay_ms(10);
    
}

void string_data(char *s)
{
    while(*s)
    {
        data_tx(*s++);
    }
}